/**
 * 프로그람 설명문서 주석
 * 2022.06. 11
 *
 *
 *           ===== 함수형 체이닝 팁 =====
 *
 *      @데이터맨들기
 *      - 함수형 도구는 배열 전체를 다룰 때, 잘 동작한다
 *
 *      - 배열 일부에 대해 동작하는 반복문이 있다면 배열 일부를
 *        새로운 배열로 나눌 수 있다
 *
 *      - map(), filter(), reduce() 같은 함수형 도구를 사용하면
 *        작업을 줄일 수 있다
 *
 *      @배열전체를다루기
 *      - 어떻게 하면 반복문을 대신에 전체 배열을 한번에 처리할 수 있을지 생각해보아야 한다
 *
 *      - map()은 모든 항목을 변환, filter()는 항목을 없애거나 유지,
 *        reduce()는 모든 항목을 합친다
 *
 *      --> 과감히 배열 전체를 처리해 보아라
 *
 *      @작은단계로나누기
 *      - 알고리즘이 너무 많은 일을 한다고 생각되면, 직관에 반하더라도 두 단계이상으로 나누어라
 *
 *      - 단계를 맨들면 더 이해하기 쉬워진다.( 작은 단계는 더 단순하기 때문 )
 *
 *      - 작은 단계가 맨들려는 목적에 얼마나 가까운지 생각해 보아야 한다
 *
 *      @조건문을filter()로바꾸기
 *      - 반복문 안에 있는 조건문은 항목을 건너뛰기 위해 사용하는 경우가 있다
 *
 *      --> filter()를 사용하여 걸러라
 *
 *      @유용한함수로추출하라
 *      - map()과 filter(), reduce()는 함수형 도구의 전부가 아니다
 *
 *      - 자주 사용하는 함수형 도구일뿐이다. 더 많은 함수형도구가 많고, 함수를 추출하고
 *        좋은 이름을 붙여 사용해야 한다
 *
 *      @개선을위해실험하기
 *      - 많은 것을 시도하고 연습하라
 *
 *      - 좋은 방법을 찾기 위해 함수형 도구를 새로운 방법으로 조합하라
 */

title( '함수형 체이닝 팁' );
{

}

