/**
 * 프로그람 설명문서 주석
 * 2022.06. 25
 *
 *
 *           ===== nestedUpdate() 시각화하기 =====
 *
 *      - nestedUpdate()는 너무 추상적인 내용이 많아서 단계별로
 *        시각화 해보는 단계
 *
 *
 *
 *      @스택( 아래로 증가 )                               @호출하는 것
 *
 *      객체          키
 *      ======================================================================================
 *      cart,       [ "shirt" , "option" , "size" ]    var value = object[ key ]
 *
 *                                                     nestedUpdate( value , keys , modify )
 *      --------------------------------------------------------------------------------------
 *      cart,       [ "shirt" , "option" , "size" ]    var value = object[ key ]
 *      shirt,      [ "option" , "size" ]
 *                                                     nestedUpdate( value , keys , modify )
 *      --------------------------------------------------------------------------------------
 *      cart,       [ "shirt" , "option" , "size" ]    var value = object[ key ]
 *      shirt,      [ "option" , "size" ]
 *      options,    [ "size" ]                         nestedUpdate( value , keys , modify )
 *
 *      ======================================================================================
 *      - 종료 조건 실행
 *      --------------------------------------------------------------------------------------
 *      cart,       [ "shirt" , "option" , "size" ]
 *      shirt,      [ "option" , "size" ]
 *      options,    [ "size" ]                         modify( object );
 *      3 ,         []
 *
 *      ======================================================================================
 *      - 열렸던 스택이 닫히는 과정( 복사본 생성 )
 *      --------------------------------------------------------------------------------------
 *      cart,       [ "shirt" , "option" , "size" ]
 *      shirt,      [ "option" , "size" ]
 *      options,    [ "size" ]                         objectSet( object , key1 , newValue1 )
 *
 *      --------------------------------------------------------------------------------------
 *      cart,       [ "shirt" , "option" , "size" ]
 *      shirt,      [ "option" , "size" ]             objectSet( object , key1 , newValue1 )
 *
 *      --------------------------------------------------------------------------------------
 *      cart,       [ "shirt" , "option" , "size" ]
 *                                                    objectSet( object , key1 , newValue1 )
 *
 *      --------------------------------------------------------------------------------------
 */
title( '' )
{

}